Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK1025SG00100.atdf
      <value-group caption="" name="SMC_MODE__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534D43"/>
      </value-group>
    </module>
    <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="EIC_CTRLA__CKSEL"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="Asynchronous Edge Detection Mode" mask="0x10" values="EIC_NMICTRL__NMIASYNCH"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO" caption="External Interrupt Event Output Enable" mask="0xFFFF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
          <bitfield name="NSCHK" caption="Non-secure Check Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
          <bitfield name="NSCHK" caption="Non-secure Check Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT" caption="External Interrupt" mask="0xFFFF"/>
          <bitfield name="NSCHK" caption="Non-secure Check Interrupt" mask="0x80000000"/>
        </register>
        <register name="ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Asynchronous Mode">
          <bitfield name="ASYNCH" caption="Asynchronous Edge Detection Mode" mask="0xFFFF" values="EIC_ASYNCH__ASYNCH"/>
        </register>
        <register name="CONFIG0" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000"/>
        </register>
        <register name="CONFIG1" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE8" caption="Input Sense Configuration 8" mask="0x7" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN8" caption="Filter Enable 8" mask="0x8"/>
          <bitfield name="SENSE9" caption="Input Sense Configuration 9" mask="0x70" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN9" caption="Filter Enable 9" mask="0x80"/>
          <bitfield name="SENSE10" caption="Input Sense Configuration 10" mask="0x700" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN10" caption="Filter Enable 10" mask="0x800"/>
          <bitfield name="SENSE11" caption="Input Sense Configuration 11" mask="0x7000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN11" caption="Filter Enable 11" mask="0x8000"/>
          <bitfield name="SENSE12" caption="Input Sense Configuration 12" mask="0x70000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN12" caption="Filter Enable 12" mask="0x80000"/>
          <bitfield name="SENSE13" caption="Input Sense Configuration 13" mask="0x700000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN13" caption="Filter Enable 13" mask="0x800000"/>
          <bitfield name="SENSE14" caption="Input Sense Configuration 14" mask="0x7000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN14" caption="Filter Enable 14" mask="0x8000000"/>
          <bitfield name="SENSE15" caption="Input Sense Configuration 15" mask="0x70000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN15" caption="Filter Enable 15" mask="0x80000000"/>
        </register>
