Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK1025SG00100.atdf
      <value-group name="RSTATUSA__TYPE">
        <value name="INVALID" caption="Region is invalid" value="0x0"/>
        <value name="SEC" caption="Region is secure" value="0x1"/>
        <value name="NONSEC" caption="Region is non secure" value="0x2"/>
        <value name="NONSEC_W" caption="Region is non secure, the associated register group implements a watermark configuration" value="0x3"/>
        <value name="SECnNONSEC_B" caption="Region is either secure or non-secure, the associated register group implements a block configuration" value="0x4"/>
        <value name="SECnNONSEC_L" caption="Region is either secure or non-secure, configuration is linked to another IDAU region configuration bit (the linked configuration bit identification info is readable from the RSTATUSC register inside the same register group)" value="0x5"/>
        <value name="NSC_W" caption="Region is non-secure callable, the associated register group implements a watermark configuration" value="0x6"/>
        <value name="EXEMPT_B" caption="Region is exempt from security, the associated register group implements a block configuration" value="0x7"/>
      </value-group>
      <value-group name="RSTATUSA__GRAN">
        <value name="GRAN_NA" caption="Not Applicable" value="0x0"/>
        <value name="GRAN_32B" caption="" value="0x5"/>
        <value name="GRAN_64B" caption="" value="0x6"/>
        <value name="GRAN_128B" caption="" value="0x7"/>
        <value name="GRAN_256B" caption="" value="0x8"/>
        <value name="GRAN_512B" caption="" value="0x9"/>
        <value name="GRAN_1KB" caption="" value="0xA"/>
        <value name="GRAN_2KB" caption="" value="0xB"/>
        <value name="GRAN_4KB" caption="" value="0xC"/>
        <value name="GRAN_8KB" caption="" value="0xD"/>
        <value name="GRAN_16KB" caption="" value="0xE"/>
        <value name="GRAN_32KB" caption="" value="0xF"/>
        <value name="GRAN_64KB" caption="" value="0x10"/>
        <value name="GRAN_128KB" caption="" value="0x11"/>
        <value name="GRAN_256KB" caption="" value="0x12"/>
        <value name="GRAN_512KB" caption="" value="0x13"/>
        <value name="GRAN_1MB" caption="" value="0x14"/>
        <value name="GRAN_2MB" caption="" value="0x15"/>
        <value name="GRAN_4MB" caption="" value="0x16"/>
        <value name="GRAN_8MB" caption="" value="0x17"/>
        <value name="GRAN_16MB" caption="" value="0x18"/>
        <value name="GRAN_32MB" caption="" value="0x19"/>
        <value name="GRAN_64MB" caption="" value="0x1A"/>
        <value name="GRAN_128MB" caption="" value="0x1B"/>
        <value name="GRAN_256MB" caption="" value="0x1C"/>
        <value name="GRAN_512MB" caption="" value="0x1D"/>
        <value name="GRAN_1GB" caption="" value="0x1E"/>
        <value name="GRAN_2GB" caption="" value="0x1F"/>
        <value name="GRAN_4GB" caption="" value="0x20"/>
      </value-group>
      <value-group name="CTRL__CMD">
        <value name="ENABLE" caption="Module Enable" value="0xA501"/>
        <value name="DISABLE" caption="Module Disable" value="0xA502"/>
        <value name="WLCK" caption="Write Lock" value="0xA503"/>
      </value-group>
    </module>
    <module name="ITM" id="SYSTEM_IP" version="1.0.0" caption="Instrumentation Macrocell">
      <register-group name="ITM" caption="Instrumentation Macrocell">
        <register name="STIM" offset="0x0" rw="RW" size="4" access-size="4" count="256" caption="ITM Stimulus Port Register n">
          <mode name="DEFAULT"/>
          <mode name="WRITE"/>
          <bitfield modes="DEFAULT" name="FIFOREADY" caption="Stimulus port can accept data" mask="0x1"/>
          <bitfield modes="DEFAULT" name="DISABLED" caption="Stimulus port enabled" mask="0x2"/>
          <bitfield modes="WRITE" name="STIMULUS" caption="Stimulus data" mask="0xFFFFFFFF"/>
        </register>
        <register name="TER" offset="0xE00" rw="RW" size="4" access-size="4" count="8" caption="ITM Trace Enable Register n">
          <bitfield name="STIMENA0" caption="Stimulus port 0 enabled" mask="0x1"/>
          <bitfield name="STIMENA1" caption="Stimulus port 1 enabled" mask="0x2"/>
          <bitfield name="STIMENA2" caption="Stimulus port 2 enabled" mask="0x4"/>
          <bitfield name="STIMENA3" caption="Stimulus port 3 enabled" mask="0x8"/>
          <bitfield name="STIMENA4" caption="Stimulus port 4 enabled" mask="0x10"/>
          <bitfield name="STIMENA5" caption="Stimulus port 5 enabled" mask="0x20"/>
          <bitfield name="STIMENA6" caption="Stimulus port 6 enabled" mask="0x40"/>
          <bitfield name="STIMENA7" caption="Stimulus port 7 enabled" mask="0x80"/>
          <bitfield name="STIMENA8" caption="Stimulus port 8 enabled" mask="0x100"/>
          <bitfield name="STIMENA9" caption="Stimulus port 9 enabled" mask="0x200"/>
          <bitfield name="STIMENA10" caption="Stimulus port 10 enabled" mask="0x400"/>
          <bitfield name="STIMENA11" caption="Stimulus port 11 enabled" mask="0x800"/>
          <bitfield name="STIMENA12" caption="Stimulus port 12 enabled" mask="0x1000"/>
          <bitfield name="STIMENA13" caption="Stimulus port 13 enabled" mask="0x2000"/>
          <bitfield name="STIMENA14" caption="Stimulus port 14 enabled" mask="0x4000"/>
          <bitfield name="STIMENA15" caption="Stimulus port 15 enabled" mask="0x8000"/>
          <bitfield name="STIMENA16" caption="Stimulus port 16 enabled" mask="0x10000"/>
          <bitfield name="STIMENA17" caption="Stimulus port 17 enabled" mask="0x20000"/>
          <bitfield name="STIMENA18" caption="Stimulus port 18 enabled" mask="0x40000"/>
          <bitfield name="STIMENA19" caption="Stimulus port 19 enabled" mask="0x80000"/>
          <bitfield name="STIMENA20" caption="Stimulus port 20 enabled" mask="0x100000"/>
          <bitfield name="STIMENA21" caption="Stimulus port 21 enabled" mask="0x200000"/>
          <bitfield name="STIMENA22" caption="Stimulus port 22 enabled" mask="0x400000"/>
          <bitfield name="STIMENA23" caption="Stimulus port 23 enabled" mask="0x800000"/>
          <bitfield name="STIMENA24" caption="Stimulus port 24 enabled" mask="0x1000000"/>
          <bitfield name="STIMENA25" caption="Stimulus port 25 enabled" mask="0x2000000"/>
          <bitfield name="STIMENA26" caption="Stimulus port 26 enabled" mask="0x4000000"/>
          <bitfield name="STIMENA27" caption="Stimulus port 27 enabled" mask="0x8000000"/>
          <bitfield name="STIMENA28" caption="Stimulus port 28 enabled" mask="0x10000000"/>
          <bitfield name="STIMENA29" caption="Stimulus port 29 enabled" mask="0x20000000"/>
          <bitfield name="STIMENA30" caption="Stimulus port 30 enabled" mask="0x40000000"/>
          <bitfield name="STIMENA31" caption="Stimulus port 31 enabled" mask="0x80000000"/>
        </register>
